tests/benchmark/results/long_conn/ab_pool_c5.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            11859

Document Path:          /users/compare/ZhangSan
Document Length:        656 bytes

Concurrency Level:      5
Time taken for tests:   102.102 seconds
Complete requests:      13
Failed requests:        11
   (Connect: 0, Receive: 0, Length: 11, Exceptions: 0)
Total transferred:      10773 bytes
HTML transferred:       9911 bytes
Requests per second:    0.13 [#/sec] (mean)
Time per request:       39269.917 [ms] (mean)
Time per request:       7853.983 [ms] (mean, across all concurrent requests)
Transfer rate:          0.10 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing: 10586 22591 11244.6  17497   48667
Waiting:    10586 22590 11244.1  17497   48664
Total:      10586 22591 11244.6  17497   48667

Percentage of the requests served within a certain time (ms)
  50%  17495
  66%  25072
  75%  25349
  80%  25352
  90%  42730
  95%  48667
  98%  48667
  99%  48667
 100%  48667 (longest request)